In [5]:
import numpy as np
import pandas as pd

data = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
example_1 = pd.Series(data)
example_1      #直接这样写和print(example_1)在Jupyter里效果一样

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

上面是Series，下面是DataFrame，他们和Python的list的共同区别是他们内部的值都是确定了类型的而不是任意类型的，大大缩小了存储空间

In [7]:
import numpy as np
import pandas as pd

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}            #pop是population
example_2 = pd.DataFrame(data)
example_2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

根据上节课的方法载入"train.csv"文件
查看DataFrame数据的每列的名称

In [6]:
import pandas as pd
import numpy as np

df = pd.read_csv('F:/Titanic/train_chinese.csv')
df.head(3)

,乘客ID,是否幸存,仓位等级,姓名,性别,年龄,兄弟姐妹个数,父母子女个数,船票信息,票价,客舱,登船港口
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [7]:
import pandas as pd
import numpy as np

df = pd.read_csv('F:/Titanic/train_chinese.csv')
df.columns                        #查看DataFrame数据的每列的名称

Index(['乘客ID', '是否幸存', '仓位等级', '姓名', '性别', '年龄', '兄弟姐妹个数', '父母子女个数', '船票信息',
       '票价', '客舱', '登船港口'],
      dtype='object')

查看"客舱"这列的所有值 [两种方法]

In [9]:
#法一
import pandas as pd
import numpy as np

df = pd.read_csv('F:/Titanic/train_chinese.csv')
df['客舱'].head(5)            #头部的5个

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: 客舱, dtype: object

In [10]:
#法二
import pandas as pd
import numpy as np

df = pd.read_csv('F:/Titanic/train_chinese.csv')
df.客舱.head(5)            #头部的5个

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: 客舱, dtype: object

删除多余的列：
del test_1['a']        （标着a的那一列）

将['PassengerId','Name','Age','Ticket']这几个列元素隐藏，只观察其他几个列元素

In [11]:
import pandas as pd
import numpy as np

df = pd.read_csv('F:/Titanic/train.csv')
df.drop(['PassengerId','Name','Age','Ticket'],axis=1).head(5)                #axis=1 drops the column, axis=0 drops the row !

   Survived  Pclass     Sex  SibSp  Parch     Fare Cabin Embarked
0         0       3    male      1      0   7.2500   NaN        S
1         1       1  female      1      0  71.2833   C85        C
2         1       3  female      0      0   7.9250   NaN        S
3         1       1  female      1      0  53.1000  C123        S
4         0       3    male      0      0   8.0500   NaN        S

如果想要完全的删除你的数据结构，使用inplace=True，因为使用inplace就将原数据覆盖了，所以这里没有用      （即再在drop里面传进一个参数）

我们以"Age"为筛选条件，显示年龄在10岁以下的乘客信息

In [12]:
import pandas as pd
import numpy as np

df = pd.read_csv('F:/Titanic/train.csv')

df[df["Age"]<10].head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.075,NaN,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.700,G6,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.125,NaN,Q

以"Age"为条件，将年龄在10岁以上和50岁以下的乘客信息显示出来，并将这个数据命名为midage

In [15]:
import pandas as pd
import numpy as np

df = pd.read_csv('F:/Titanic/train.csv')

midage = df[(df["Age"]>10)& (df["Age"]<50)]
midage.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

重排新索引，避免索引产生的干扰

In [16]:
import pandas as pd
import numpy as np

df = pd.read_csv('F:/Titanic/train.csv')

midage = df[(df["Age"]>10)& (df["Age"]<50)]

midage = midage.reset_index(drop=True)            #reset句即此作用
midage.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

将midage的数据中第100行的"Pclass"和"Sex"的数据显示出来  （如果要求先显示Sex，只要调转即可）

In [18]:
import pandas as pd
import numpy as np

df = pd.read_csv('F:/Titanic/train.csv')

midage = df[(df["Age"]>10)& (df["Age"]<50)]

midage = midage.reset_index(drop=True)


midage.loc[[100],['Sex','Pclass']]          #loc = locate

      Sex  Pclass
100  male       2

使用loc方法将midage的数据中第100，105，108行的"Pclass"，"Name"和"Sex"的数据显示出来

In [19]:
import pandas as pd
import numpy as np

df = pd.read_csv('F:/Titanic/train.csv')
midage = df[(df["Age"]>10)& (df["Age"]<50)]
midage = midage.reset_index(drop=True)


midage.loc[[100,105,108],['Pclass','Name','Sex']]

     Pclass                               Name   Sex
100       2  Byles, Rev. Thomas Roussel Davids  male
105       3           Cribb, Mr. John Hatfield  male
108       3                    Calic, Mr. Jovo  male

使用iloc方法将midage的数据中第100，105，108行的"Pclass"，"Name"和"Sex"的数据显示出来

In [20]:
import pandas as pd
import numpy as np

df = pd.read_csv('F:/Titanic/train.csv')
midage = df[(df["Age"]>10)& (df["Age"]<50)]
midage = midage.reset_index(drop=True)


midage.iloc[[100,105,108],[2,3,4]]                 #iloc = index locate

     Pclass                               Name   Sex
100       2  Byles, Rev. Thomas Roussel Davids  male
105       3           Cribb, Mr. John Hatfield  male
108       3                    Calic, Mr. Jovo  male